SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
/**
 * *****************************************************************************
 * @file    main.c
 * @brief   Standalone Camera + ToF Snapshot Capture — NUCLEO-N657X0-Q
 *
 *   Captures images from the CMW-IMX335 camera module and stores them as
 *   raw YUV422 frames on a microSD card.  Includes VL53L5CX Time-of-Flight
 *   sensor integration for distance measurements.
 *
 *   No USB/UVC, no FileX/fatfs, no PC connection required after flashing.
 *
 *   Hardware:
 *     - MCU:      STM32N657 (NUCLEO-N657X0-Q / MB1940)
 *     - Camera:   CMW-IMX335 (5 MP, YUV422 output via CSI-2)
 *     - ToF:      VL53L5CX (8x8 resolution, continuous mode)
 *     - Storage:  microSD card (SDMMC2, 4-bit bus)
 *     - Button:   USER B1 = PC13 (active HIGH, external pull-down)
 *     - LEDs:     RED = PG10, GREEN = PG0
 *     - Illumination: WS2812 (GPDMA1 + TIM1 PWM)
 *
 *   Flow (OPTIMIZED - Sleep Mode):
 *     1. Boot → init clocks, MPU, PSRAM, SD card
 *     2. Init camera + warmup frames (one-time cost at boot)
 *     3. STOP camera pipe (sleep = low power, fast wakeup)
 *     4. GREEN LED on (system ready)
 *     5. User presses USER button (PC13)
 *     6. START pipe → 3 frames → capture → STOP pipe (~100ms total)
 *     7. Frame saved to SD card
 *     8. Back to sleep → wait for next press
 *
 *   Two FreeRTOS tasks:
 *     - main_thread: board init, SD card init, camera sleep mode init,
 *                    then deletes itself
 *     - btn_thread:  polls USER button, triggers fast capture + SD write
 *
 *   All configurable parameters are in Inc/app_config.h.
 * *****************************************************************************
 */

/* ================================================================
   SECTION 1: INCLUDES
   ================================================================ */

#include <assert.h>
#include <stdio.h>
#include <string.h>

/* ---- STM32 HAL / BSP ---- */
#include "stm32n6xx_hal_conf.h"
#include "stm32n6xx_hal.h"
#include "stm32n6xx_hal_sd.h"
#include "stm32n6xx_hal_rif.h"
//#include "stm32n6xx_nucleo.h"
//#include "stm32n6xx_nucleo_bus.h"
//#include "stm32n6xx_nucleo_xspi.h"

#include "stm32n6570_discovery.h"
#include "stm32n6570_discovery_bus.h"
#include "stm32n6570_discovery_xspi.h"

/* ---- Illumination (WS2812) ---- */
#include "ws2812.h"

/* ---- Time of Flight (VL53L5CX) - Modular Detection API ---- */
#include "vl53l5cx_detection.h"
#include "i2c_arbiter.h"

/* ---- Application Modules ---- */
#include "app_config.h"
#include "app_cam.h"
#include "app_fuseprogramming.h"
#include "app_thread.h"
#include "debug_color.h"
#include "main.h"
#include "npu_cache.h"
#include "utils.h"

/* ---- FreeRTOS ---- */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"

/* ================================================================
   SECTION 2: GLOBAL PERIPHERAL HANDLES
   ================================================================ */

/* I2C */
I2C_HandleTypeDef hi2c1;

/* UART (Debug Console) */
UART_HandleTypeDef huart1;

/* microSD (SDMMC2) */
SD_HandleTypeDef hsd1;

/* TIM1 (WS2812 PWM) */
TIM_HandleTypeDef htim1;

/* DMA (WS2812 Data) */
DMA_HandleTypeDef handle_GPDMA1_Channel1;

/* I2C handle is declared here and passed to VL53L5CX_Init() */

/* ================================================================
   SECTION 3: FREERTOS TASK CONTROL BLOCKS AND STACKS
   ================================================================ */

static StaticTask_t    main_thread_cb;
static StackType_t     main_thread_stack[configMINIMAL_STACK_SIZE];

static StaticTask_t    btn_thread_cb;
static StackType_t     btn_thread_stack[4 * configMINIMAL_STACK_SIZE];

/** Sensor task (ToF monitoring + insect detection) */
static StaticTask_t    sensor_thread_cb;
static StackType_t     sensor_thread_stack[SENSOR_TASK_STACK_SIZE];

/** Camera task (acquisition: continuous/snapshot) */
static StaticTask_t    camera_thread_cb;
static StackType_t     camera_thread_stack[CAMERA_TASK_STACK_SIZE];

/** Storage task (SD card writes) */
static StaticTask_t    storage_thread_cb;
static StackType_t     storage_thread_stack[STORAGE_TASK_STACK_SIZE];

/* ================================================================
   SECTION 4: FORWARD DECLARATIONS
   ================================================================ */

/* ---- System Configuration ---- */
static void SystemClock_Config(void);
static void Security_Config(void);
static void IAC_Config(void);
static void CONSOLE_Config(void);
static void Setup_Mpu(void);

/* ---- FreeRTOS Entry Points ---- */
static int   main_freertos(void);
static void  main_thread_fct(void *arg);
static void  btn_thread_fct(void *arg);
/* insect_detection_task moved to app_thread.c as sensor_task() */

/* ---- SD Card Operations ---- */
static int   SD_Benchmarks(void);
static int   SD_StoreRawImage(const uint8_t *img_buf, uint32_t img_size,
                              uint32_t w, uint32_t h, uint32_t pixel_format);
static int   SD_ReadRawImage(uint8_t *img_buf, uint32_t *data_size_p);

/* ---- Peripheral Initialization (WS2812 / Illumination) ---- */
static void MX_TIM1_Init(void);
static void MX_GPDMA1_Init(void);
void        PeriphCommonClock_Config(void);

/* ---- VL53L5CX ToF Sensor (I2C init stays in main.c for board-specific config) ---- */
static void VL53L5CX_I2C_Init(void);
/* All other VL53L5CX functions are in vl53l5cx_detection.h/.c */

/* ---- External References ---- */
extern void  vPortSetupTimerInterrupt(void);
extern int   __uncached_bss_start__;
extern int   __uncached_bss_end__;

/* SD_Reinit is defined in app_thread.c (now non-static) — called by btn_thread
   on SD write failure to recover the card before the next capture. */
extern int SD_Reinit(void);


/* ================================================================
   SECTION 5: RUNTIME STATE AND BUFFERS
   ================================================================ */

/* System readiness flag (set by main_thread, polled by other tasks)
   NOTE: Not static — referenced via extern by app_thread.c */
volatile int system_ready = 0;

/* Snapshot counter and base block tracking */
static uint32_t snap_count = 0;
static uint32_t snap_base_block = SD_SNAP_BASE_BLOCK;

