SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
/** Camera frame buffer — allocated in PSRAM for DMA access.
    NOTE: Not static — referenced via extern by app_cam.c (CAM_ContinuousSnap). */
uint8_t capture_buf[MAX_SNAP_FRAME_SIZE] ALIGN_32 IN_PSRAM;

/** SD batch-write buffer — allocated in PSRAM for multi-block writes.
    Size = SD_BATCH_WRITE_BLOCKS * SD_BLOCK_SIZE = 64 * 512 = 32 KB.
    This buffer holds multiple 512-byte SD blocks so we can write them
    in a single HAL_SD_WriteBlocks() call, drastically reducing the
    number of HAL API calls per snapshot (~307 instead of ~19,643).
    NOTE: Not static — referenced by app_thread.c (storage_task). */
uint8_t sd_batch_buf[SD_BATCH_WRITE_BLOCKS * SD_BLOCK_SIZE] ALIGN_32 IN_PSRAM;

/** Save buffer — allocated in PSRAM.
    In CONTINUOUS mode (CAPTURE_MODE=1), the camera double-buffers between
    capture_buf/capture_buf2 continuously (no stop/restart). On ToF trigger,
    CAM_ContinuousSnap() waits for the next completed frame and copies it
    (once) into save_buf, which is what gets written to SD.
    In CALLBACK-BATCH mode (CAPTURE_MODE=4), save_buf is used as the
    second ping-pong buffer for hardware double-buffering (DCMIPP
    alternates DMA between capture_buf and save_buf automatically).
    NOTE: Not static — referenced via extern by app_thread.c (mode 1)
    and app_cam.c (mode 4). */
#if CAPTURE_MODE == 1 || CAPTURE_MODE == 4
uint8_t save_buf[MAX_SNAP_FRAME_SIZE] ALIGN_32 IN_PSRAM;
#endif

/** Second raw ping-pong buffer for CONTINUOUS mode's hardware double
    buffering (CAPTURE_MODE=1 only). DCMIPP alternates DMA between
    capture_buf and capture_buf2 forever while the pipe is running; on
    trigger, CAM_ContinuousSnap() figures out which one just completed and
    copies ONLY that one frame into save_buf.
    NOTE: Not static — referenced via extern by app_cam.c. */
#if CAPTURE_MODE == 1
uint8_t capture_buf2[MAX_SNAP_FRAME_SIZE] ALIGN_32 IN_PSRAM;
#endif

/** Batch buffer for batch capture mode — allocated in PSRAM.
    Used in BATCH mode (CAPTURE_MODE=2) and CALLBACK-BATCH mode (CAPTURE_MODE=4).
     On ToF trigger, we grab BATCH_FRAMES into batch_buf
     (each slot = SNAP_FRAME_SIZE), then send them to storage_task
     sequentially for SD writing.

     Size = BATCH_FRAMES × SNAP_FRAME_SIZE
     For 1296x972@YUV422 (2.5MB/frame), BATCH_FRAMES=3 → 7.5MB total.
     NOTE: Not static — referenced via extern by app_thread.c (camera_task). */
#if CAPTURE_MODE == 2 || CAPTURE_MODE == 4
uint8_t batch_buf[BATCH_BUF_SIZE] ALIGN_32 IN_PSRAM;
#endif

/** Capture-in-progress guard — prevents simultaneous captures.
    When set to 1, new detection events are ignored until the current
    capture + SD write is complete. */
static volatile int capture_in_progress = 0;


/* ================================================================
   SD CARD IMAGE HEADER FORMAT
   ================================================================ */

typedef struct {
    uint32_t magic;
    uint32_t width;
    uint32_t height;
    uint32_t pixel_format;
    uint32_t data_size;
    uint32_t timestamp;
    uint32_t checksum;
    uint32_t snap_id;
    uint8_t  reserved[28];
} sd_image_header_t;

#define SD_HEADER_TAG       0x49444745U

static uint32_t SD_IMG_BASE_BLOCK = 1000;


/* ================================================================
   SECTION 6: ENTRY POINT
   ================================================================ */

int main(void)
{
    /* Enable instruction cache */
    MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_ICACTIVE_Msk;
    __HAL_RCC_CPUCLK_CONFIG(RCC_CPUCLKSOURCE_HSI);
    __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);

    /* Basic HAL initialization */
    HAL_Init();
    Setup_Mpu();
    SCB_EnableICache();

#if defined(USE_DCACHE)
    MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_DCACTIVE_Msk;
    SCB_EnableDCache();
#endif

    /* Start FreeRTOS scheduler */
    return main_freertos();
}


/* ================================================================
   SECTION 7: MPU SETUP
   ================================================================ */

/**
 * @brief  Configure Memory Protection Unit
 *
 *         Sets up a non-cacheable region for the .uncached_bss section
 *         to ensure proper access for peripherals that require it.
 */
static void Setup_Mpu(void)
{
    MPU_Attributes_InitTypeDef attr;
    MPU_Region_InitTypeDef     region;

    /* Configure non-cacheable memory attribute */
    attr.Number     = MPU_ATTRIBUTES_NUMBER0;
    attr.Attributes = MPU_NOT_CACHEABLE;
    HAL_MPU_ConfigMemoryAttributes(&attr);

    /* Map attribute to .uncached_bss region */
    region.Enable           = MPU_REGION_ENABLE;
    region.Number           = MPU_REGION_NUMBER0;
    region.BaseAddress      = (uint32_t)&__uncached_bss_start__;
    region.LimitAddress     = (uint32_t)&__uncached_bss_end__ - 1;
    region.AttributesIndex  = MPU_ATTRIBUTES_NUMBER0;
    region.AccessPermission = MPU_REGION_ALL_RW;
    region.DisableExec      = MPU_INSTRUCTION_ACCESS_ENABLE;
    region.DisablePrivExec  = MPU_PRIV_INSTRUCTION_ACCESS_ENABLE;
    region.IsShareable      = MPU_ACCESS_NOT_SHAREABLE;
    HAL_MPU_ConfigRegion(&region);
    HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
    memset(&__uncached_bss_start__, 0, &__uncached_bss_end__ - &__uncached_bss_start__);
}


/* ================================================================
   SECTION 8: SECURITY CONFIGURATION
   ================================================================ */

/**
 * @brief  Configure RIF (Resource Identification and Firewall) settings
 *
 *         Sets master and slave security attributes for various
 *         peripherals (NPU, DMA2D, CSI, DCMIPP, LTDC, USB OTG).
 *         Also configures DMA and GPIO attributes for illumination
 *         and I2C peripherals.
 */
static void Security_Config(void)
{
    __HAL_RCC_RIFSC_CLK_ENABLE();
    __HAL_RCC_SYSCFG_CLK_ENABLE();
    volatile uint32_t delay = 1000;
    while (delay--);

    RIMC_MasterConfig_t RIMC_master = {0};
    RIMC_master.MasterCID = RIF_CID_1;
    RIMC_master.SecPriv   = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV;

    /* Configure master attributes for secure peripherals */
    HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_NPU,    &RIMC_master);
    HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_DMA2D,  &RIMC_master);
    HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_DCMIPP, &RIMC_master);
    HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC1,  &RIMC_master);
    HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC2,  &RIMC_master);
    HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_OTG1,   &RIMC_master);

    /* Configure slave secure attributes */
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_NPU,    RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_DMA2D,  RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_CSI,    RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_DCMIPP, RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDC,   RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDCL1, RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDCL2, RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_JPEG,   RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_OTG1HS, RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);

    /* ---- Illumination (WS2812) DMA + GPIO attributes ---- */
    if (HAL_DMA_ConfigChannelAttributes(&handle_GPDMA1_Channel1,
                                        DMA_CHANNEL_SEC | DMA_CHANNEL_PRIV |
                                        DMA_CHANNEL_SRC_SEC | DMA_CHANNEL_DEST_SEC) != HAL_OK) {
        //Error_Handler();
    }
    HAL_GPIO_ConfigPinAttributes(GPIOE, GPIO_PIN_9, GPIO_PIN_SEC | GPIO_PIN_NPRIV);

    /* ---- I2C GPIO attributes (VL53L5CX) ---- */
    HAL_GPIO_ConfigPinAttributes(GPIOC, GPIO_PIN_1, GPIO_PIN_SEC | GPIO_PIN_NPRIV);
    HAL_GPIO_ConfigPinAttributes(GPIOH, GPIO_PIN_9, GPIO_PIN_SEC | GPIO_PIN_NPRIV);
}


/* ================================================================
   SECTION 9: IAC CONFIGURATION
   ================================================================ */

/**
 * @brief  Initialize Illegal Access Controller
 */
static void IAC_Config(void)
{
    __HAL_RCC_IAC_CLK_ENABLE();
    __HAL_RCC_IAC_FORCE_RESET();
    __HAL_RCC_IAC_RELEASE_RESET();
}

/** IAC Interrupt Handler — traps into infinite loop on illegal access */
void IAC_IRQHandler(void) { while (1) {} }


/* ================================================================
   SECTION 10: SYSTEM CLOCK CONFIGURATION
   ================================================================ */

/**
 * @brief  Configure system clocks using PLL1-4
 *
 *         PLL1: IC1 (CPU)    — 200 MHz
 *         PLL2: IC6          — 125 MHz (CSI/DCMIPP)
 *         PLL3: IC11         — 225 MHz
 *         PLL4: USB          —  480 MHz / 32 = 15 MHz → USB 480M
 */
static void SystemClock_Config(void)
{
    RCC_ClkInitTypeDef              RCC_ClkInitStruct      = {0};
    RCC_OscInitTypeDef              RCC_OscInitStruct      = {0};
    RCC_PeriphCLKInitTypeDef        RCC_PeriphCLKInitStruct = {0};

