SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
    BSP_SMPS_Init(SMPS_VOLTAGE_OVERDRIVE);
    HAL_Delay(1);

    /* ---- PLL1: CPU Core Clock (200 MHz via IC1) ---- */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_NONE;
    RCC_OscInitStruct.PLL1.PLLState  = RCC_PLL_ON;
    RCC_OscInitStruct.PLL1.PLLSource = RCC_PLLSOURCE_HSI;
    RCC_OscInitStruct.PLL1.PLLM      = 2;
    RCC_OscInitStruct.PLL1.PLLN      = 25;
    RCC_OscInitStruct.PLL1.PLLFractional = 0;
    RCC_OscInitStruct.PLL1.PLLP1     = 1;
    RCC_OscInitStruct.PLL1.PLLP2     = 1;

    /* ---- PLL2: IC6 Clock (125 MHz) ---- */
    RCC_OscInitStruct.PLL2.PLLState  = RCC_PLL_ON;
    RCC_OscInitStruct.PLL2.PLLSource = RCC_PLLSOURCE_HSI;
    RCC_OscInitStruct.PLL2.PLLM      = 8;
    RCC_OscInitStruct.PLL2.PLLN      = 125;
    RCC_OscInitStruct.PLL2.PLLFractional = 0;
    RCC_OscInitStruct.PLL2.PLLP1     = 1;
    RCC_OscInitStruct.PLL2.PLLP2     = 1;

    /* ---- PLL3: IC11 Clock (225 MHz) ---- */
    RCC_OscInitStruct.PLL3.PLLState  = RCC_PLL_ON;
    RCC_OscInitStruct.PLL3.PLLSource = RCC_PLLSOURCE_HSI;
    RCC_OscInitStruct.PLL3.PLLM      = 16;
    RCC_OscInitStruct.PLL3.PLLN      = 225;
    RCC_OscInitStruct.PLL3.PLLFractional = 0;
    RCC_OscInitStruct.PLL3.PLLP1     = 1;
    RCC_OscInitStruct.PLL3.PLLP2     = 1;

    /* ---- PLL4: USB Clock ---- */
    RCC_OscInitStruct.PLL4.PLLState  = RCC_PLL_ON;
    RCC_OscInitStruct.PLL4.PLLSource = RCC_PLLSOURCE_HSI;
    RCC_OscInitStruct.PLL4.PLLM      = 32;
    RCC_OscInitStruct.PLL4.PLLN      = 20;
    RCC_OscInitStruct.PLL4.PLLFractional = 0;
    RCC_OscInitStruct.PLL4.PLLP1     = 1;
    RCC_OscInitStruct.PLL4.PLLP2     = 1;

    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) { while (1); }

    /* ---- Clock Tree Distribution ---- */
    RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_CPUCLK | RCC_CLOCKTYPE_SYSCLK |
                                   RCC_CLOCKTYPE_HCLK   | RCC_CLOCKTYPE_PCLK1 |
                                   RCC_CLOCKTYPE_PCLK2   | RCC_CLOCKTYPE_PCLK4 |
                                   RCC_CLOCKTYPE_PCLK5);
    RCC_ClkInitStruct.CPUCLKSource   = RCC_CPUCLKSOURCE_IC1;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_IC2_IC6_IC11;
    RCC_ClkInitStruct.IC1Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
    RCC_ClkInitStruct.IC1Selection.ClockDivider   = 1;
    RCC_ClkInitStruct.IC2Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
    RCC_ClkInitStruct.IC2Selection.ClockDivider   = 2;
    RCC_ClkInitStruct.IC6Selection.ClockSelection = RCC_ICCLKSOURCE_PLL2;
    RCC_ClkInitStruct.IC6Selection.ClockDivider   = 1;
    RCC_ClkInitStruct.IC11Selection.ClockSelection = RCC_ICCLKSOURCE_PLL3;
    RCC_ClkInitStruct.IC11Selection.ClockDivider   = 1;
    RCC_ClkInitStruct.AHBCLKDivider   = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB1CLKDivider  = RCC_APB1_DIV1;
    RCC_ClkInitStruct.APB2CLKDivider  = RCC_APB2_DIV1;
    RCC_ClkInitStruct.APB4CLKDivider  = RCC_APB4_DIV1;
    RCC_ClkInitStruct.APB5CLKDivider  = RCC_APB5_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct) != HAL_OK) { while (1); }

    /* ---- Peripheral Clocks ---- */
    RCC_PeriphCLKInitStruct.PeriphClockSelection = 0;
    RCC_PeriphCLKInitStruct.PeriphClockSelection |= RCC_PERIPHCLK_XSPI1;
    RCC_PeriphCLKInitStruct.Xspi1ClockSelection  = RCC_XSPI1CLKSOURCE_HCLK;
    RCC_PeriphCLKInitStruct.PeriphClockSelection |= RCC_PERIPHCLK_XSPI2;
    RCC_PeriphCLKInitStruct.Xspi2ClockSelection  = RCC_XSPI2CLKSOURCE_HCLK;
    RCC_PeriphCLKInitStruct.PeriphClockSelection |= RCC_PERIPHCLK_SDMMC2;
    RCC_PeriphCLKInitStruct.Sdmmc2ClockSelection = RCC_SDMMC2CLKSOURCE_HCLK;

    if (HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct) != HAL_OK) { while (1); }
}


/* ================================================================
   SECTION 11: DEBUG CONSOLE (UART)
   ================================================================ */

/**
 * @brief  Initialize USART1 for debug output
 *
 *         PE5 = TX, PE6 = RX, 115200 baud, 8N1
 */
static void CONSOLE_Config(void)
{
    GPIO_InitTypeDef gpio_init;
    __HAL_RCC_USART1_CLK_ENABLE();
    __HAL_RCC_GPIOE_CLK_ENABLE();

    gpio_init.Pin       = GPIO_PIN_5 | GPIO_PIN_6;
    gpio_init.Mode      = GPIO_MODE_AF_PP;
    gpio_init.Pull      = GPIO_PULLUP;
    gpio_init.Speed     = GPIO_SPEED_FREQ_HIGH;
    gpio_init.Alternate = GPIO_AF7_USART1;
    HAL_GPIO_Init(GPIOE, &gpio_init);

    huart1.Instance          = USART1;
    huart1.Init.BaudRate     = 115200;
    huart1.Init.Mode         = UART_MODE_TX_RX;
    huart1.Init.Parity       = UART_PARITY_NONE;
    huart1.Init.WordLength   = UART_WORDLENGTH_8B;
    huart1.Init.StopBits     = UART_STOPBITS_1;
    huart1.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_8;

    if (HAL_UART_Init(&huart1) != HAL_OK) { while (1); }
}


/* ================================================================
   SECTION 12: SD CARD BENCHMARK
   ================================================================ */

#define SD_BENCH_BLOCKS  64
#define SD_BENCH_BYTES   (SD_BENCH_BLOCKS * SD_BLOCK_SIZE)

static uint8_t sd_wbuf[SD_BENCH_BYTES];
static uint8_t sd_rbuf[SD_BENCH_BYTES];

/**
 * @brief  Run SD card read/write speed benchmark
 *
 *         Writes and reads 64 blocks (32 KB), reports speed and integrity.
 *         Returns 0 on success (both write + read pass), -1 on any failure.
 */
static int SD_Benchmarks(void)
{
    uint32_t          t0, t1;
    HAL_StatusTypeDef st;
    float             speed;
    uint32_t          blk = 200;
    uint32_t          i;

    for (i = 0; i < SD_BENCH_BYTES; i++)
        sd_wbuf[i] = (uint8_t)((i ^ 0xA5) & 0xFF);

    printf("\n ==== SD Speed Test (blocking, %d blocks) ====\n", SD_BENCH_BLOCKS);
    printf("  Bus : %s | ClkDiv : %lu\n\n",
           (hsd1.Init.BusWide == SDMMC_BUS_WIDE_4B) ? "4B" : "1B",
           (unsigned long)hsd1.Init.ClockDiv);

    /* Write benchmark */
    printf("[W] ");
    t0 = HAL_GetTick();
    st = HAL_SD_WriteBlocks(&hsd1, sd_wbuf, blk, SD_BENCH_BLOCKS, HAL_MAX_DELAY);
    t1 = HAL_GetTick();

    if (st == HAL_OK && t1 > t0) {
        speed = (float)SD_BENCH_BYTES / ((float)(t1 - t0) * 1000.0f);
        printf("OK  %.2f MB/s  (%lu ms)\n", speed, (unsigned long)(t1 - t0));
    } else {
        printf("FAIL HAL=0x%08lX STA=0x%08lX\n",
               (unsigned long)st, (unsigned long)SDMMC2->STA);
        printf(" ==== Done ====\n");
        return -1;
    }

    /* Read benchmark */
    printf("[R] ");
    t0 = HAL_GetTick();
    st = HAL_SD_ReadBlocks(&hsd1, sd_rbuf, blk, SD_BENCH_BLOCKS, HAL_MAX_DELAY);
    t1 = HAL_GetTick();

    if (st == HAL_OK && t1 > t0) {
        speed = (float)SD_BENCH_BYTES / ((float)(t1 - t0) * 1000.0f);
        printf("OK  %.2f MB/s  (%lu ms)\n", speed, (unsigned long)(t1 - t0));
        uint32_t errs = 0;
        for (i = 0; i < SD_BENCH_BYTES; i++)
            if (sd_rbuf[i] != sd_wbuf[i]) errs++;
        printf("[.] Integrity: %s  (%lu errors)\n",
               errs == 0 ? "PASSED" : "FAILED", errs);
    } else {
        printf("FAIL HAL=0x%08lX STA=0x%08lX\n",
               (unsigned long)st, (unsigned long)SDMMC2->STA);
        printf(" ==== Done ====\n");
        return -1;
    }

    printf(" ==== Done ====\n");
    return 0;
}


/* ================================================================
   SECTION 13: SD CARD IMAGE STORAGE (BATCHED)
   ================================================================ */

/**
 * @brief  Store a raw image frame to SD card with header metadata
 *
 *         Uses batched writes (SD_BATCH_WRITE_BLOCKS per HAL call) for
 *         much faster throughput than single-block writes.
 *
 * @param  img_buf       Pointer to image data buffer
 * @param  img_size      Size of image data in bytes
 * @param  w             Image width in pixels
 * @param  h             Image height in pixels
 * @param  pixel_format  Pixel format identifier
 * @return 0 on success, -1 on failure
 */
static int SD_StoreRawImage(const uint8_t *img_buf, uint32_t img_size,
                            uint32_t w, uint32_t h, uint32_t pixel_format)
{
    uint32_t         base = SD_IMG_BASE_BLOCK;
    uint32_t         total_blocks = (SD_IMG_HEADER_SIZE + img_size + SD_BLOCK_SIZE - 1) / SD_BLOCK_SIZE;
    uint32_t         i, checksum = 0;

    /* ---- Overflow protection: check if this snapshot fits on the card ---- */
    if (hsd1.SdCard.BlockNbr > 0) {
        uint32_t last_block = base + total_blocks - 1;
        if (last_block >= hsd1.SdCard.BlockNbr) {
            printf("[SD Store] OVERFLOW! block %lu >= card max %lu\n",
                   (unsigned long)last_block, (unsigned long)hsd1.SdCard.BlockNbr);
            return -1;
        }
    }

    /* Compute XOR checksum of image data */
    for (i = 0; i < img_size; i++)
        checksum ^= img_buf[i];

    /* Build image header */
    sd_image_header_t hdr;
    hdr.magic        = SD_HEADER_TAG;
    hdr.width        = w;
    hdr.height       = h;
    hdr.pixel_format = pixel_format;
    hdr.data_size    = img_size;
    hdr.timestamp    = HAL_GetTick();
    hdr.checksum     = checksum;
    hdr.snap_id      = 0;
    memset(hdr.reserved, 0, sizeof(hdr.reserved));

    /* ---- Use the PSRAM batch buffer (sd_batch_buf) for all writes ---- */
    uint32_t batch_size = SD_BATCH_WRITE_BLOCKS * SD_BLOCK_SIZE;

    printf("\n[SD Store] %lux%lu fmt=%lu  %lu bytes  %lu blocks  (batch=%lu blocks/call)\n",
           (unsigned long)w, (unsigned long)h, pixel_format,
           img_size, total_blocks, (unsigned long)SD_BATCH_WRITE_BLOCKS);

    /* --- Step 1: Write header block (block 0 of this snapshot) ---
       The header is 64 bytes at offset 0; image data starts at offset 64.
       Fill the rest of the first block with image data, then pad
       remaining batch slots with zeros. */
    memset(sd_batch_buf, 0, batch_size);
    memcpy(sd_batch_buf, &hdr, SD_IMG_HEADER_SIZE);
    uint32_t first_chunk = SD_BLOCK_SIZE - SD_IMG_HEADER_SIZE;
    if (first_chunk > img_size) first_chunk = img_size;
    memcpy(sd_batch_buf + SD_IMG_HEADER_SIZE, img_buf, first_chunk);

    /* If image has more data, also pre-fill batch slots 2..N */
    uint32_t img_offset = first_chunk;          /* bytes of image already in block 0 */
    uint32_t batch_blk  = 1;                    /* next block index within batch (0 = header) */
    while (img_offset < img_size && batch_blk < SD_BATCH_WRITE_BLOCKS) {
        uint32_t chunk = SD_BLOCK_SIZE;
        if (chunk > img_size - img_offset) chunk = img_size - img_offset;
        memcpy(sd_batch_buf + batch_blk * SD_BLOCK_SIZE, img_buf + img_offset, chunk);
        if (chunk < SD_BLOCK_SIZE)
            memset(sd_batch_buf + batch_blk * SD_BLOCK_SIZE + chunk, 0, SD_BLOCK_SIZE - chunk);
        img_offset += chunk;
        batch_blk++;
    }

    /* Write however many blocks we filled (at least 1 for the header) */
    uint32_t blocks_to_write = batch_blk;

