SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
            uint32_t t_sd_start = HAL_GetTick();

            if (SD_StoreRawImage(capture_buf, frame_size, SNAP_WIDTH, SNAP_HEIGHT, 0) == 0) {
                snap_count++;
                uint32_t t_sd_end = HAL_GetTick();
                printf("[BTN] >>> Snapshot #%lu SAVED (block %lu)\n",
                       (unsigned long)snap_num, (unsigned long)target_block);
                printf("[PERF] Capture=%lums + SD=%lums = Total=%lums\n",
                       (unsigned long)capture_elapsed,
                       (unsigned long)(t_sd_end - t_sd_start),
                       (unsigned long)(t_sd_end - t_capture_start));
            } else {
                printf("[BTN] >>> SD write FAILED — reinitializing card...\n");
                /* Reinit SD card so NEXT capture can still write (same pattern as
                   storage_task retry-after-reinit). snap_base_block was NOT advanced,
                   so the next snapshot will overwrite the same base block. */
                SD_Reinit();
                /* Reset snap_base_block back to the original base so the next
                   capture writes to the correct sequential position. */
                snap_base_block = saved_base + ((snap_count) * total_blocks);
            }

            /* Deactivate illumination and restore status LEDs */
            BSP_LED_Off(LED_RED);
            BSP_LED_On(LED_GREEN);
            WS2812_TurnOff();

            /* Wait for button release */
            while (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) == GPIO_PIN_SET)
                vTaskDelay(pdMS_TO_TICKS(50));
        }

        vTaskDelay(pdMS_TO_TICKS(BTN_POLL_DELAY_MS));
    }
}

/* ================================================================
   SECTION 15: FREERTOS INITIALIZATION
   ================================================================ */

/**
 * @brief  Create and start FreeRTOS tasks
 *
 *         Tasks created:
 *         - main_thread   (priority IDLE+1): Board init, then deletes itself
 *         - storage_task  (priority IDLE+2): SD card writes (blocking OK)
 *         - camera_task   (priority IDLE+3): Camera acquisition (fast response)
 *         - sensor_task   (priority IDLE+4): ToF monitoring (highest, detection critical)
 *         - btn_thread    (priority IDLE+3): Button polling + manual capture
 */
static int main_freertos(void)
{
    TaskHandle_t hdl;

    /* Create the I2C1 arbiter mutex BEFORE any task starts. The camera
       (BSP_I2C1_*) and the VL53L5CX ToF sensor (raw hi2c1 in platform.c)
       are two independent HAL handles driving the same physical I2C1 bus;
       without this mutex, concurrent use (e.g. CAPTURE_MODE=1's continuous
       ISP servicing running alongside the ToF ranging loop) can corrupt
       the bus protocol. See i2c_arbiter.h. */
    I2C_Arbiter_Init();

    /* ---- Main init thread (lowest priority, deletes itself) ---- */
    hdl = xTaskCreateStatic(main_thread_fct, "main",
                            configMINIMAL_STACK_SIZE, NULL,
                            tskIDLE_PRIORITY + 1,
                            main_thread_stack, &main_thread_cb);
    assert(hdl != NULL);

    /* ---- Storage task (blocking SD writes) ---- */
    hdl = xTaskCreateStatic(storage_task, "storage",
                            STORAGE_TASK_STACK_SIZE, NULL,
                            tskIDLE_PRIORITY + 2,
                            storage_thread_stack, &storage_thread_cb);
    assert(hdl != NULL);

    /* ---- Camera task (acquisition, high priority for fast snaps) ---- */
    hdl = xTaskCreateStatic(camera_task, "camera",
                            CAMERA_TASK_STACK_SIZE, NULL,
                            tskIDLE_PRIORITY + 3,
                            camera_thread_stack, &camera_thread_cb);
    assert(hdl != NULL);

    /* ---- Sensor task (ToF monitoring, highest priority for detection) ----
       Not needed in ON-DEMAND mode (CAPTURE_MODE=0): capture is triggered
       purely by the USER button via btn_thread, ToF stays fully off. */
#if CAPTURE_MODE != 0
    hdl = xTaskCreateStatic(sensor_task, "sensor",
                            SENSOR_TASK_STACK_SIZE, NULL,
                            tskIDLE_PRIORITY + 4,
                            sensor_thread_stack, &sensor_thread_cb);
    assert(hdl != NULL);
#else
    (void)sensor_thread_stack;
    (void)sensor_thread_cb;
#endif

    /* ---- Button task (manual capture, ON-DEMAND mode only) ---- */
#if CAPTURE_MODE == 0
    hdl = xTaskCreateStatic(btn_thread_fct, "btn",
                            4 * configMINIMAL_STACK_SIZE, NULL,
                            tskIDLE_PRIORITY + 3,
                            btn_thread_stack, &btn_thread_cb);
    assert(hdl != NULL);
#else
    /* In CONTINUOUS/BATCH mode the camera pipe is always running.
       btn_thread would conflict with CAM_ContinuousStart().
       Manual capture is not available — use ToF detection only. */
    (void)btn_thread_stack;
    (void)btn_thread_cb;
#endif

    vTaskStartScheduler();
    assert(0);
    return -1;
}


/* ================================================================
   SECTION 16: MAIN THREAD (runs once: board init, then deletes)
   ================================================================ */

/**
 * @brief  Main initialization task
 *
 *         Performs all hardware initialization in sequence:
 *         1. NVIC priorities
 *         2. System clock
 *         3. Debug console
 *         4. Fuse programming
 *         5. WS2812 illumination (DMA + TIM)
 *         6. VL53L5CX ToF sensor (I2C + GPIO)
 *         7. PSRAM (XSPI RAM + NOR)
 *         8. LEDs + User button
 *         9. Security + IAC config
 *         10. Low-power clock gates
 *         11. SD card init + benchmark
 *         12. Set system_ready flag, delete task
 */
static void main_thread_fct(void *arg)
{
    (void)arg;
    uint32_t preemptPriority, subPriority;
    IRQn_Type i;
    int ret;

    /* ---- NVIC Priority Configuration ---- */
    HAL_NVIC_GetPriority(SysTick_IRQn, HAL_NVIC_GetPriorityGrouping(),
                         &preemptPriority, &subPriority);
    for (i = PVD_PVM_IRQn; i <= LTDC_UP_ERR_IRQn; i++)
        HAL_NVIC_SetPriority(i, preemptPriority, subPriority);

    /* ---- Clocks + Console + Fuses ---- */
    SystemClock_Config();
    vPortSetupTimerInterrupt();
    CONSOLE_Config();
    Fuse_Programming();




