SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
    /* ---- Illumination System (WS2812) ---- */
    printf("[INIT] Light system\n");
    MX_GPDMA1_Init();
    MX_TIM1_Init();
    WS2812_Init();
    /* ----

    /* ---- PSRAM Initialization ---- */
#ifdef STM32N6570_DK_REV
    BSP_XSPI_RAM_Init(0);
    BSP_XSPI_RAM_EnableMemoryMappedMode(0);
#endif

    BSP_XSPI_NOR_Init_t NOR_Init;
    NOR_Init.InterfaceMode  = BSP_XSPI_NOR_OPI_MODE;
    NOR_Init.TransferRate   = BSP_XSPI_NOR_DTR_TRANSFER;
    BSP_XSPI_NOR_Init(0, &NOR_Init);
    BSP_XSPI_NOR_EnableMemoryMappedMode(0);

    /* ---- LEDs + User Button ---- */
    ret = BSP_LED_Init(LED_GREEN); assert(ret == BSP_ERROR_NONE);
    ret = BSP_LED_Init(LED_RED);   assert(ret == BSP_ERROR_NONE);

    BSP_PB_Init(BUTTON_USER1, BUTTON_MODE_GPIO);
    printf("[BTN] PC13 initialized via BSP (active HIGH). State=%s\n",
           BSP_PB_GetState(BUTTON_USER1) == GPIO_PIN_SET ? "PRESSED" : "RELEASED");

    /* ---- Security + IAC ---- */
    Security_Config();
    IAC_Config();

    /* ---- Low-Power Clock Gates ---- */
    LL_BUS_EnableClockLowPower(~0);
    LL_MEM_EnableClockLowPower(~0);
    LL_AHB1_GRP1_EnableClockLowPower(~0);
    LL_AHB2_GRP1_EnableClockLowPower(~0);
    LL_AHB3_GRP1_EnableClockLowPower(~0);
    LL_AHB4_GRP1_EnableClockLowPower(~0);
    LL_AHB5_GRP1_EnableClockLowPower(~0);
    LL_APB1_GRP1_EnableClockLowPower(~0);
    LL_APB1_GRP2_EnableClockLowPower(~0);
    LL_APB2_GRP1_EnableClockLowPower(~0);
    LL_APB4_GRP1_EnableClockLowPower(~0);
    LL_APB4_GRP2_EnableClockLowPower(~0);
    LL_APB5_GRP1_EnableClockLowPower(~0);
    LL_MISC_EnableClockLowPower(~0);

    /* ---- SD Card Initialization (with retry loop) ----
       SD card detection can be flaky on first attempt due to:
       - Card power-up timing (some cards need 1-2 seconds to stabilize)
       - Signal integrity on SDIO lines
       - Card state machine not ready after reset

       We retry the full init sequence up to SD_MAX_RETRIES times until success. */
    #define SD_MAX_RETRIES  5
    #define SD_RETRY_DELAY_MS 500

    printf("\n=== SD Card Detection Test ===\n");

    HAL_PWREx_EnableVddIO5();
    for (volatile uint32_t d = 0; d < 500000; d++);

    int sd_ok = 0;
    for (int attempt = 1; attempt <= SD_MAX_RETRIES && !sd_ok; attempt++) {
        printf("[SD] Init attempt %d/%d ...\n", attempt, SD_MAX_RETRIES);

        RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};
        PeriphClkInit.PeriphClockSelection  = RCC_PERIPHCLK_SDMMC2;
        PeriphClkInit.Sdmmc2ClockSelection  = RCC_SDMMC2CLKSOURCE_HCLK;
        HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit);

        /* Full peripheral reset between attempts */
        __HAL_RCC_SDMMC2_FORCE_RESET();
        HAL_Delay(10);
        __HAL_RCC_SDMMC2_RELEASE_RESET();
        HAL_Delay(10);

        hsd1.Instance             = SDMMC2;
        hsd1.Init.ClockEdge       = SDMMC_CLOCK_EDGE_RISING;
        hsd1.Init.ClockPowerSave  = SDMMC_CLOCK_POWER_SAVE_DISABLE;
        hsd1.Init.BusWide         = SDMMC_BUS_WIDE_4B;
        hsd1.Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
        hsd1.Init.ClockDiv        = 2;
        hsd1.State                = HAL_SD_STATE_RESET;

        HAL_SD_MspInit(&hsd1);
        HAL_StatusTypeDef status = HAL_SD_Init(&hsd1);

        if (status == HAL_OK) {
            printf("[SD] Switching to 4-bit bus width...\n");
            status = HAL_SD_ConfigWideBusOperation(&hsd1, SDMMC_BUS_WIDE_4B);
            if (status == HAL_OK) {
                hsd1.Init.BusWide = SDMMC_BUS_WIDE_4B;
                printf("[SD] 4-bit bus width configured successfully\n");
            } else {
                printf("[SD] Wide bus config failed (%lu), staying in 1-bit\n", (unsigned long)status);
                status = HAL_OK;
            }
        }

        if (status == HAL_OK) {
            uint64_t     total_bytes = (uint64_t)hsd1.SdCard.BlockNbr * (uint64_t)hsd1.SdCard.BlockSize;
            unsigned long size_mb    = (unsigned long)(total_bytes / 1048576UL);
            unsigned long size_gb    = (unsigned long)(total_bytes / 1073741824UL);

            printf("\n*** SD CARD DETECTED SUCCESSFULLY! (attempt %d) ***\n\n", attempt);
            printf("  Card Size: %lu GB (%lu MB)\n", size_gb, size_mb);
            printf("  Blocks:    %lu x %lu bytes\n",
                   (unsigned long)hsd1.SdCard.BlockNbr, (unsigned long)hsd1.SdCard.BlockSize);
            printf("  Card Type: %s\n",
                   (hsd1.SdCard.CardType == CARD_SDHC_SDXC) ? "SDHC/SDXC" : "SDSC");
            printf("  Bus Width: %s\n",
                   (hsd1.Init.BusWide == SDMMC_BUS_WIDE_4B) ? "4-bit" : "1-bit");

            /* Storage capacity info */
            uint32_t blocks_per_snap = (SD_IMG_HEADER_SIZE + SNAP_FRAME_SIZE + SD_BLOCK_SIZE - 1) / SD_BLOCK_SIZE;
            uint32_t available_blocks = hsd1.SdCard.BlockNbr - SD_SNAP_BASE_BLOCK;
            uint32_t max_snaps = available_blocks / blocks_per_snap;
            printf("  Blocks/snapshot: %lu\n", (unsigned long)blocks_per_snap);
            printf("  Max snapshots: ~%lu (from block %lu onward)\n",
                   (unsigned long)max_snaps, (unsigned long)SD_SNAP_BASE_BLOCK);
            printf("\n");

            /* Benchmark: both write AND read must pass.
               Common failure: [W] OK but [R] FAIL — card detected but not stable.
               Treat benchmark failure as init failure and retry. */
            int bench_rc = SD_Benchmarks();
            if (bench_rc == 0) {
                sd_ok = 1;
            } else {
                printf("[SD] Benchmark FAILED on attempt %d (retrying full init)\n", attempt);
                HAL_SD_DeInit(&hsd1);
                if (attempt < SD_MAX_RETRIES)
                    HAL_Delay(SD_RETRY_DELAY_MS);
            }
        } else {
            printf("[SD] Init failed: HAL=0x%08lX (retrying in %d ms)\n",
                   (unsigned long)status, SD_RETRY_DELAY_MS);
            /* Deinit to clean up state before retry */
            HAL_SD_DeInit(&hsd1);
            if (attempt < SD_MAX_RETRIES)
                HAL_Delay(SD_RETRY_DELAY_MS);
        }
    }

    if (!sd_ok) {
        printf("\n[ERROR] SD card NOT detected after %d attempts! Camera captures will fail.\n", SD_MAX_RETRIES);
    }

