SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
    /* ---- Initialize IPC (queues + semaphores) ----
       Must be done AFTER console init (printf used in IPC_Init diagnostics)
       and BEFORE setting system_ready (tasks poll system_ready then use IPC). */
    if (IPC_Init() != pdTRUE) {
        printf("[FATAL] IPC_Init failed! Cannot start threaded tasks.\n");
        while (1);
    }

    /* ---- Camera Init Before Tasks Start ----
        CRITICAL: Must be done BEFORE system_ready=1 to avoid I2C1 conflict.
        The IMX335 camera and VL53L5CX ToF sensor share I2C1. If camera_task
        tries to init camera after system_ready=1, it races with sensor_task
        which is already using I2C1 for ToF → CMW_CAMERA_Init fails (ret=-7).

        Solution: Init camera HERE in main_thread (single-threaded, no ToF yet).
        Mode 4: full init + warmup + standby. When ToF triggers, camera wakes.
        Mode 1: full init + warmup + leaves pipe RUNNING. Camera_task does NOT
        re-init — it just services ISP in the idle loop. */
#if CAPTURE_MODE == 4
    printf("[INIT] Camera callback-batch init (before tasks start to avoid I2C conflict)...\n");
    if (CAM_CallbackInit(capture_buf, MAX_SNAP_FRAME_SIZE, SNAP_WIDTH, SNAP_HEIGHT, SNAP_FPS) != 0) {
        printf("[WARN] Camera callback init FAILED! Captures may fail.\n");
    } else {
        printf("[INIT] Camera in STANDBY mode, ready for callback-batch wakeup.\n");
    }
#elif CAPTURE_MODE == 1
    printf("[INIT] Camera continuous init (before tasks start to avoid I2C conflict)...\n");
    /* Mode 1: init camera + warmup, leave pipe running continuously.
       capture_buf and capture_buf2 are the double-buffer targets.
       camera_task will NOT call CAM_ContinuousStart again. */
    if (CAM_ContinuousStart(capture_buf, MAX_SNAP_FRAME_SIZE, SNAP_WIDTH, SNAP_HEIGHT, SNAP_FPS) != 0) {
        printf("[WARN] Camera continuous init FAILED! Captures may fail.\n");
    } else {
        printf("[INIT] Camera CONTINUOUS mode active, pipe running.\n");
    }
#endif

    /* ---- System Ready ---- */
    printf("\n===========================================\n");
    printf("[INFO] System READY!\n");
    printf("[INFO] Multi-threaded architecture active:\n");
    printf("[INFO]   - sensor_task  (ToF monitoring)\n");
    printf("[INFO]   - camera_task  (acquisition)\n");
    printf("[INFO]   - storage_task (SD writes)\n");
    printf("[INFO]   - btn_thread   (manual capture)\n");

#if CAPTURE_MODE == 2
    printf("[INFO] Capture Mode: BATCH (%d frames/detection)\n", BATCH_FRAMES);
#elif CAPTURE_MODE == 4
    printf("[INFO] Capture Mode: CALLBACK-BATCH (%d frames/detection, NO stop/restart)\n", CALLBACK_FRAMES);
#elif CAPTURE_MODE == 1
    printf("[INFO] Capture Mode: CONTINUOUS (camera_task starts pipe)\n");
#else
    printf("[INFO] Capture Mode: ON-DEMAND (camera_task inits per capture)\n");
#endif

    printf("[INFO] Press USER button (PC13) to capture + save.\n");
    printf("===========================================\n\n");
    /* ---- I2C1 for VL53L5CX ToF (MUST be before tasks start) ---- */
    VL53L5CX_I2C_Init();
    VL53L5CX_PowerUp();
    system_ready = 1;
    vTaskDelete(NULL);
}


/* ================================================================
   SECTION 17: DCMIPP CLOCK CONFIGURATION
   ================================================================ */

/**
 * @brief  Configure DCMIPP and CSI clock sources
 *
 *         DCMIPP → IC17 from PLL2/3 = 125/3 ≈ 41.7 MHz
 *         CSI    → IC18 from PLL1/40 = 200/40 = 5 MHz
 */
HAL_StatusTypeDef MX_DCMIPP_ClockConfig(DCMIPP_HandleTypeDef *hdcmipp)
{
    (void)hdcmipp;
    RCC_PeriphCLKInitTypeDef RCC_PeriphCLKInitStruct = {0};
    HAL_StatusTypeDef        ret;

    RCC_PeriphCLKInitStruct.PeriphClockSelection   = RCC_PERIPHCLK_DCMIPP;
    RCC_PeriphCLKInitStruct.DcmippClockSelection   = RCC_DCMIPPCLKSOURCE_IC17;
    RCC_PeriphCLKInitStruct.ICSelection[RCC_IC17].ClockSelection = RCC_ICCLKSOURCE_PLL2;
    RCC_PeriphCLKInitStruct.ICSelection[RCC_IC17].ClockDivider   = 3;
    ret = HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct);
    if (ret) return ret;

    RCC_PeriphCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_CSI;
    RCC_PeriphCLKInitStruct.ICSelection[RCC_IC18].ClockSelection = RCC_ICCLKSOURCE_PLL1;
    RCC_PeriphCLKInitStruct.ICSelection[RCC_IC18].ClockDivider   = 40;
    ret = HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct);
    if (ret) return ret;

    return HAL_OK;
}


/* ================================================================
   SECTION 18: USB MSP INIT
   ================================================================ */

/**
 * @brief  USB OTG HS MSP initialization (called by HAL when USB is used)
 */
void HAL_PCD_MspInit(PCD_HandleTypeDef *hpcd)
{
    assert(hpcd->Instance == USB1_OTG_HS);
    __HAL_RCC_PWR_CLK_ENABLE();
    HAL_PWREx_EnableVddUSBVMEN();
    while (__HAL_PWR_GET_FLAG(PWR_FLAG_USB33RDY) == 0U);
    HAL_PWREx_EnableVddUSB();
    __HAL_RCC_USB1_OTG_HS_CLK_ENABLE();
    USB1_HS_PHYC->USBPHYC_CR &= ~(0x7U << 0x4U);
    USB1_HS_PHYC->USBPHYC_CR |= (0x2U << 0x4U);
    __HAL_RCC_USB1_OTG_HS_PHY_CLK_ENABLE();
    HAL_NVIC_SetPriority(USB1_OTG_HS_IRQn, 6U, 0U);
    HAL_NVIC_EnableIRQ(USB1_OTG_HS_IRQn);
}


/* ================================================================
   SECTION 19: PERIPHERAL INITIALIZATION (TIM1, GPDMA1, CLOCK)
   ================================================================ */

/**
 * @brief  TIM1 initialization for WS2812 PWM signal generation
 *
 *         Prescaler = 5 → 200 MHz / 6 = 33.33 MHz timer clock
 *         Period    = 500 → PWM frequency ≈ 66.67 kHz
 *         Channel 1, PWM1 mode
 */
static void MX_TIM1_Init(void)
{
    TIM_ClockConfigTypeDef sClockSourceConfig = {0};
    TIM_MasterConfigTypeDef sMasterConfig = {0};
    TIM_OC_InitTypeDef sConfigOC = {0};
    TIM_BreakDeadTimeConfigTypeDef sBreakDeadTimeConfig = {0};

    htim1.Instance = TIM1;
    htim1.Init.Prescaler = 5;      /* 200 MHz / 6 = 33.33 MHz */
    htim1.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim1.Init.Period = 500;
    htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim1.Init.RepetitionCounter = 0;
    htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    HAL_TIM_Base_Init(&htim1);

    sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
    HAL_TIM_ConfigClockSource(&htim1, &sClockSourceConfig);
    HAL_TIM_PWM_Init(&htim1);

